Documents/ОбращениеВСтационар.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОбращениеВСтационар</Name>
			<BasedOn>
				<xr:Item>Document.Прием</xr:Item>
				<xr:Item>Document.БронированиеКойкоМеста</xr:Item>
				<xr:Item>Document.Заявка</xr:Item>
				<xr:Item>Document.ОказаниеУслуг</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛечащийВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправившееУчреждение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиагнозНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиагнозПоступления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьДоставленСкоройПомощью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставленПоЭкстреннымПоказателям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧерезЧасовПослеНачалаЗаболевания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаГоспитализации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщитьРодственникам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказВГоспитализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказаВГоспитализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.удалитьПричиныОтказаВГоспитализации</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйПовторныйОтказ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтказаВГоспитализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяОтказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятыеМеры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекомендации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиНаправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналГоспитализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыГоспитализации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНаряда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлкогольноеОпьянение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаркотическоеОпьянение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяГоспитализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникЗафиксировавшийОтказ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказЗаконныйПредставитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпьянениеДатаВремяВзятияПробы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпьянениеРезультатВзятияПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяИнформированияЗП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторноеПоступление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтационараНаправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтационара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЗначенияПараметровHTML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПараметровHTML</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПараметрыHTML</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументУстановкиЗначенияПараметраПриема</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИндексШаблона</Name>
					<Comment>Индекс строки шаблона приема в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДвижениеКоечногоФонда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДвижениеКоечногоФонда</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКоек</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Койка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостояниеКойкоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостояниеКойкоМеста</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСостоянийКойкоМест</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыМедицинскихКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыМедицинскихКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Амбулаторная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стоматологическая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стационар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГинекологическаяБеременной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>омг_СтационарРК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОтказаВГоспитализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОтказаВГоспитализации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Первичный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Повторный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДвиженияВСтационаре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДвиженияВСтационаре</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводМеждуПодразделениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выписка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОбращениеВСтационар/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область РазделОписанияПеременных

&НаКлиенте
Перем мИспользоватьАвтоПодборКлиентовПоКоду; // При автоподборе и окончании ввода текста указывает, следует ли искать введенное значение в кодах справочника.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();	
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма);
	
	Если Объект.Ссылка.Пустая() Тогда 
		Если Не ЗначениеЗаполнено(Объект.ДатаВремяПоступления) Тогда
			Объект.ДатаВремяПоступления = ТекущаяДата();
		КонецЕсли;
		
		Если Параметры.Свойство("ЗначенияЗаполнения")
			И Параметры.ЗначенияЗаполнения.Свойство("ДокументОснование") 
		Тогда
			ПараметрДокументОснование = Параметры.ЗначенияЗаполнения.ДокументОснование;
		ИначеЕсли Параметры.Свойство("Основание") Тогда
			ПараметрДокументОснование = Параметры.Основание;
		КонецЕсли;
		
		// Добавлено Макеев (
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Прием.МедицинскаяКарта КАК МедицинскаяКарта,
		               |	Прием.Ссылка КАК Ссылка,
		               |	Прием.Дата КАК Дата,
		               |	Прием.Врач.Подразделение КАК ВрачПодразделение
		               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
		               |ИЗ
		               |	Документ.Прием КАК Прием
		               |ГДЕ
		               |	Прием.Ссылка = &Ссылка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата УБЫВ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА НЕ ЗначенияПараметровHTML.Параметр.Код = ""000003959""
		               |			ТОГДА ""Палата""
		               |		ИНАЧЕ ""Койка""
		               |	КОНЕЦ КАК ТипПараметра,
		               |	ЗначенияПараметровHTML.Значение КАК Значение
		               |ПОМЕСТИТЬ ВТ_ДопПараметры
		               |ИЗ
		               |	РегистрСведений.ЗначенияПараметровHTML КАК ЗначенияПараметровHTML
		               |ГДЕ
		               |	(ЗначенияПараметровHTML.Параметр.Код = ""000003958""
		               |			ИЛИ ЗначенияПараметровHTML.Параметр.Код = ""000003959"")
		               |	И ЗначенияПараметровHTML.Документ В
		               |			(ВЫБРАТЬ
		               |				ВТ_ДанныеДокумента.Ссылка КАК Ссылка
		               |			ИЗ
		               |				ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ДанныеДокумента.МедицинскаяКарта КАК МедицинскаяКарта,
		               |	ВТ_ДанныеДокумента.Ссылка КАК Ссылка,
		               |	ВТ_ДанныеДокумента.Дата КАК Дата,
		               |	Палаты.Ссылка КАК Палата,
		               |	КойкоМеста.Ссылка КАК Койка
		               |ИЗ
		               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ВТ_ДопПараметры.Значение КАК Палата,
		               |			ВТ_ДопПараметры1.Значение КАК Койка
		               |		ИЗ
		               |			ВТ_ДопПараметры КАК ВТ_ДопПараметры
		               |				ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ДопПараметры КАК ВТ_ДопПараметры1
		               |				ПО ВТ_ДопПараметры.ТипПараметра <> ВТ_ДопПараметры1.ТипПараметра) КАК ВложенныйЗапрос
		               |		ПО (ИСТИНА)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Палаты КАК Палаты
		               |		ПО ВТ_ДанныеДокумента.ВрачПодразделение = Палаты.Подразделение
		               |			И (Палаты.Наименование = ЕСТЬNULL(ВложенныйЗапрос.Палата, """"))
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КойкоМеста КАК КойкоМеста
		               |		ПО (КойкоМеста.Владелец = Палаты.Ссылка)
		               |			И (КойкоМеста.Наименование = ЕСТЬNULL(ВложенныйЗапрос.Койка, """"))";
		Запрос.УстановитьПараметр("Ссылка", Объект.ДокументОснование);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Палата = Выборка.Палата;
			Койка = Выборка.Койка;
		КонецЕсли;
		// )
		Если ТипЗнч(ПараметрДокументОснование) = Тип("ДокументСсылка.БронированиеКойкоМеста") Тогда
			Палата = ПараметрДокументОснование.Палата;
			Койка  = ПараметрДокументОснование.КойкоМесто;
			Объект.ДатаВремяГоспитализации = ПараметрДокументОснование.ДатаНачала;
		Иначе
			Объект.ДатаВремяГоспитализации = Объект.ДатаВремяПоступления;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.КаналГоспитализации) Тогда
			Объект.КаналГоспитализации = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(4, "КаналыГоспитализации");
		КонецЕсли;
	КонецЕсли;
	
	Режим530н = Объект.Дата >= Стационар.ДатаВступленияПриказа530н();
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		Полис = Объект.Клиент.умцОсновнойСтраховойПолис;
		Элементы.Полис.ПараметрыВыбора = СформироватьПараметрыВыбораДляПолиса(Объект.Клиент);
	КонецЕсли;
	
	НастроитьЭлементыФормыПриСоздании(); 
	
	ОбновитьНадписьБронь(ЭтотОбъект);
	
	// В старых документах причина отказа из отдельного справочника. В новых из КлассификаторыМинЗдрава
	Если Не ЗначениеЗаполнено(Объект.ПричинаОтказаВГоспитализации) 
		Или ТипЗнч(Объект.ПричинаОтказаВГоспитализации) = Тип("СправочникСсылка.КлассификаторыМинЗдрава")
	Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.КлассификаторыМинЗдрава");
		ЭтаФорма.Элементы.ПричинаОтказаВГоспитализации.ОграничениеТипа = ОписаниеТипа;
		Объект.ПричинаОтказаВГоспитализации = ОписаниеТипа.ПривестиЗначение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
	МедицинскаяКартаПриИзменении(Неопределено);
	ОтказВГоспитализацииПриИзменении(Неопределено);
	ПересчитатьЗаголовокФактУпотребленияВеществ();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Объект.ПометкаУдаления Тогда
	
		// Проверка, что по этой медкарте еще нет документа обращения в стационар
		Если Объект.Ссылка.Пустая() Тогда
			Обращение = Стационар.ОбращениеПоМедкарте(Объект.МедицинскаяКарта);
			Если ЗначениеЗаполнено(Обращение) Тогда
				Отказ = Истина;
				СообщениеПользователю = СтрШаблон("По данной медкарте уже оформлено обращение: %1", Строка(Обращение));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПользователю);
			КонецЕсли;
		КонецЕсли;
		
		// Проверки по коечному фонду
		Если Не ЗначениеЗаполнено(Элементы.ПоступлениеВпалату.Заголовок)
			И ЗначениеЗаполнено(Койка)
		Тогда
			// Проверка занятости койки, указанной для быстрого создания Установки условий пребывания.
			СостояниеКойки = РегистрыСведений.ДвижениеКоечногоФонда.ПолучитьДвижениеКойки(Койка, Объект.ДатаВремяГоспитализации);
			Документ = Неопределено;
			Если РегистрыСведений.СостояниеКойкоМеста.КойкаЗанята(Койка, Объект.ДатаВремяГоспитализации, Документ) Тогда
				Если Документ.Клиент <> Объект.Клиент Тогда
					Отказ = Истина;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Койка %1 занята документом %2!", Койка, Документ));
				КонецЕсли;
			ИначеЕсли СостояниеКойки <> Неопределено И СостояниеКойки.Статус <> Перечисления.СостоянияКоек.ПустаяСсылка() Тогда
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Койка %1 недоступна, так как находится %2!", Койка, Нрег(Строка(СостояниеКойки.Статус))));					
			КонецЕсли;
		
			// Проверка, числятся ли пациент в стационаре (занимает койку)
			ДокументРазмещенияВПалату = Стационар.ПолучитьДокументПоступленияПациентаСтационара(Объект.Клиент,Объект.ДатаВремяГоспитализации);
			Если ЗначениеЗаполнено(ДокументРазмещенияВПалату) Тогда
				Отказ = Истина;
				Сообщение = СтрШаблон("Пациент уже размещен в палате стационара %1 (по состоянию на %2)!",
									   ДокументРазмещенияВПалату.Палата,
									   Формат(Объект.ДатаВремяГоспитализации, "ДФ=dd.MM.yyyy"));
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);
	
	Если Не Объект.ОтказВГоспитализации
		И Не ЗначениеЗаполнено(Элементы.ПоступлениеВПалату.Заголовок)
		И ПравоДоступа("Добавление", Метаданные.Документы.УстановкаУсловийПребывания)
	Тогда
		СоздатьПоступлениеПациентаВПалату();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбработчикиДинамическиСоздаваемыхКоманд

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриемВрача(Команда)
	
	Если РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(ЭтаФорма) Тогда
		ЗначенияЗаполнения = Новый Структура("Клиент, МедицинскаяКарта, Основание", Объект.Клиент, Объект.МедицинскаяКарта, Объект.Ссылка);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения, МедицинскаяКарта, ЭтоПриемВСтационаре", ЗначенияЗаполнения, Объект.МедицинскаяКарта, Истина);
		ОткрытьФорму("Документ.Прием.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПоискКлиентов(Команда)
	
	ФормаКлиента =  ПолучитьФорму("ОбщаяФорма.ФормаПоискаКлиентаУпр",,Элементы.Клиент);
	ФормаКлиента.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ДатаГоспитализацииТекущая(Команда)
	
	Объект.ДатаВремяГоспитализации = ТекущаяДата();
	
КонецПроцедуры

#Область КнопкаСоздатьМедкарту

&НаКлиенте
Процедура СоздатьМедкарту(Команда)
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		
		ВидКарты = ОсновнойВидКартСтационар();
		
		Если ЗначениеЗаполнено(ВидКарты) Тогда
			Объект.МедицинскаяКарта = СоздатьМедкартуСтационар(Объект.Клиент, ВидКарты, Объект.Филиал);
			ТекущийЭлемент = Элементы.МедицинскаяКарта
		Иначе
			Отбор = Новый Структура("ТипКарты", ПредопределенноеЗначение("Перечисление.ТипыМедицинскихКарт.Стационар"));
			Оповещение = Новый ОписаниеОповещения("СоздатьМедкарту_ПослеВыбораВидаКарты", ЭтотОбъект);
			ОткрытьФорму("Справочник.ВидыМедицинскихКарт.ФормаВыбора", Новый Структура("Отбор", Отбор), ЭтотОбъект,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(, "Не выбран пациент");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМедкарту_ПослеВыбораВидаКарты(ВидКарты, ДополнительныеСведения) Экспорт
	
	Если ЗначениеЗаполнено(ВидКарты) Тогда
		
		Объект.МедицинскаяКарта = СоздатьМедкартуСтационар(Объект.Клиент, ВидКарты, Объект.Филиал);
		ТекущийЭлемент = Элементы.МедицинскаяКарта
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьМедкартуСтационар(Клиент, ВидКарты, Филиал)
	
	Медкарта = Справочники.МедицинскиеКарты.СоздатьЭлемент();
	Медкарта.ВидКарты = ВидКарты;
	Медкарта.Клиент = Клиент;
	Медкарта.Филиал = Филиал;
	Медкарта.ДатаРегистрации = ТекущаяДата();
	ОтраслевыеДополнения.ФормированиеНомера(Медкарта, Истина);
	
	Медкарта.Записать();
	
	Возврат Медкарта.Ссылка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОсновнойВидКартСтационар() Экспорт
	
	Запрос = Новый Запрос;
	// Изменено Макеев (
	ПрочиеНастройки = омг_МедицинскаяДеятельность.ПолучитьПрочиеНастройкиСистемы();
	ТипКарты = Перечисления.ТипыМедицинскихКарт.Стационар;
	Если ПрочиеНастройки.Свойство("ТипКартыСтационара") Тогда
		ТипКарты = ПрочиеНастройки.ТипКартыСтационара;
	КонецЕсли;
	Запрос.УстановитьПараметр("ТипКарты", ТипКарты);
	// )
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыМедицинскихКарт.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыМедицинскихКарт КАК ВидыМедицинскихКарт
	|ГДЕ
	|	ВидыМедицинскихКарт.ТипКарты = &ТипКарты
	|	И НЕ ВидыМедицинскихКарт.Архив"
	;
	Выб = Запрос.Выполнить().Выбрать();
	
	Если Выб.Количество() = 1 Тогда
		Выб.Следующий();
		Возврат Выб.Ссылка;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Режим530н = Объект.Дата >= Стационар.ДатаВступленияПриказа530н();
	
	НастроитьЭлементФормыПричинаОбстоятельство(Элементы.ДиагнозПоступления, Режим530н, Объект.ДиагнозПоступления);
	Элементы.ПервичныйПовторныйОтказ.Видимость = Не Режим530н;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Клиент) 
		И Не ЗначениеЗаполнено(Объект.МедицинскаяКарта)
	Тогда
		Объект.МедицинскаяКарта = Стационар.ПолучитьМедКартуСтационара(Объект.Клиент);
	КонецЕсли;
	
	МедицинскаяКартаПриИзменении(Неопределено);
	
	Полис = ОбщегоНазначения.ПолучитьЗначениеРеквизита( Объект.Клиент, "умцОсновнойСтраховойПолис");
		
	Элементы.Полис.ПараметрыВыбора = СформироватьПараметрыВыбораДляПолиса(Объект.Клиент);
	
	ОбновитьНадписьБронь(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
						  
	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора, мИспользоватьАвтоПодборКлиентовПоКоду);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора, мИспользоватьАвтоПодборКлиентовПоКоду);
	
КонецПроцедуры

&НаКлиенте
Процедура МедицинскаяКартаПриИзменении(Элемент)
	Элементы.СоздатьМедкарту.Видимость = Не ЗначениеЗаполнено(Объект.МедицинскаяКарта);
КонецПроцедуры

&НаКлиенте
Процедура ДатаГоспитализацииПриИзменении(Элемент)
	
	// Акутализация параметра выбора медкарты: дата регистрации карты
	ПараметрыВыбораИзменение = Новый Массив(Элементы.МедицинскаяКарта.ПараметрыВыбора);
	Для Инд = 0 По ПараметрыВыбораИзменение.Количество()-1 Цикл
		ПараметрВыбора = ПараметрыВыбораИзменение[Инд];
		Если ПараметрВыбора.Имя = "ДатаАктуальностиКарт" Тогда
			Если НачалоДня(ПараметрВыбора.Значение) <> НачалоДня(Объект.ДатаВремяГоспитализации) Тогда
				
				ПараметрыВыбораИзменение.Удалить(Инд);
				Если ЗначениеЗаполнено(Объект.ДатаВремяГоспитализации) Тогда
					ПараметрВыбораНовый = Новый ПараметрВыбора("ДатаАктуальностиКарт", Объект.ДатаВремяГоспитализации);
					ПараметрыВыбораИзменение.Вставить(Инд, ПараметрВыбораНовый);
				КонецЕсли;
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.МедицинскаяКарта.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораИзменение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказВГоспитализацииПриИзменении(Элемент)
	
	Элементы.СтраницыГоспитализацияОтказ.ТекущаяСтраница =
		?(Объект.ОтказВГоспитализации, Элементы.СтраницаОтказ, Элементы.СтраницаГоспитализация);
	
	Если Объект.ОтказВГоспитализации Тогда 
		Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			Объект.Подразделение = ПредопределенноеЗначение("Справочник.Подразделения.ПустаяСсылка"); //***
		КонецЕсли;

		Если Объект.Ссылка.Пустая() Тогда 
			Объект.ПервичныйПовторныйОтказ = ПредопределенноеЗначение("Перечисление.ВидыОтказаВГоспитализации.Первичный");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ДатаВремяОтказа) Тогда
			Объект.ДатаВремяОтказа = ТекущаяДата();
		КонецЕсли;
	Иначе
		Если Элемент <> Неопределено Тогда // Интерактивное изменение или аналог.
			Объект.ПервичныйПовторныйОтказ = Неопределено;
			Объект.ПричинаОтказаВГоспитализации = ПредопределенноеЗначение("Справочник.КлассификаторыМинЗдрава.ПустаяСсылка");
			Объект.ДатаВремяОтказа = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДиагнозПоступленияПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.ДиагнозПоступления) = Тип("СправочникСсылка.Диагнозы") Тогда
		ДиагнозПоступленияКодДиагноза = ДопСерверныеФункции.ПолучитьРеквизит(Объект.ДиагнозПоступления, "КодДиагноза");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДиагнозНаправленияПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.ДиагнозНаправления) = Тип("СправочникСсылка.Диагнозы") Тогда
		ДиагнозНаправленияКодДиагноза = ДопСерверныеФункции.ПолучитьРеквизит(Объект.ДиагнозНаправления, "КодДиагноза");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АлкогольноеОпьянениеПриИзменении(Элемент)
	ПересчитатьЗаголовокФактУпотребленияВеществ();
КонецПроцедуры

&НаКлиенте
Процедура НаркотическоеОпьянениеПриИзменении(Элемент)
	ПересчитатьЗаголовокФактУпотребленияВеществ();
КонецПроцедуры

&НаКлиенте
Процедура КойкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВозможныйЛагОформления = 10 * 60;
	Если ТекущаяДата() > Объект.ДатаВремяГоспитализации
		И (ТекущаяДата() - Объект.ДатаВремяГоспитализации) <= ВозможныйЛагОформления
	Тогда
		ДатаАнализаЗанятостиКоек = ТекущаяДата();
	Иначе
		ДатаАнализаЗанятостиКоек = Объект.ДатаВремяГоспитализации;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("Дата, БлокироватьВыборЗанятых", ДатаАнализаЗанятостиКоек, Истина);
	СтруктураПараметров.Вставить("Филиал", Объект.Филиал);
	СтруктураПараметров.Вставить("Клиент", Объект.Клиент);
	ОткрытьФорму("Справочник.КойкоМеста.ФормаВыбора",СтруктураПараметров,Элементы.Койка,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПалатаПолучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
		
	СтруктураПараметров = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		СтруктураПараметров.Вставить("Подразделение", Объект.Подразделение);	
	КонецЕсли;
	ОткрытьФорму("Справочник.Палаты.ФормаВыбора",СтруктураПараметров,Элементы.ПалатаПолучатель,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	

КонецПроцедуры

&НаКлиенте
Процедура ПалатаПолучательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Палата = ВыбранноеЗначение;
		Объект.Подразделение = ОбщегоНазначенияСервер.ПолучитьРеквизитСсылки(Палата, "Подразделение"); 
		Элементы.Койка.СписокВыбора.ЗагрузитьЗначения(Стационар.КойкиПалаты(Палата));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КойкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПодключитьОбработчикОжидания("КойкаОбработкаВыбораОбновитьПалату", 0.01, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КойкаОбработкаВыбораОбновитьПалату()
	
	РасположениеКойки = РасположениеКойки(Койка);
	
	Если Палата <> РасположениеКойки.Палата Тогда
		Элементы.Койка.СписокВыбора.ЗагрузитьЗначения(Стационар.КойкиПалаты(Палата));
		Палата = РасположениеКойки.Палата;
	КонецЕсли;

	Объект.Подразделение = РасположениеКойки.Подразделение;
	Элементы.ПалатаПолучатель.ОбновитьТекстРедактирования();
	Элементы.Подразделение.ОбновитьТекстРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Если Палата.Пустая() Тогда
		Койка = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаналГоспитализацииПриИзменении(Элемент)
	
	// Подстановка пути поступления по типу поступления(т.е. по тому, кем доставлен)
	Если ЗначениеЗаполнено(Объект.КаналГоспитализации)
		И ТипЗнч(Объект.КаналГоспитализации) = Тип("СправочникСсылка.КаналыГоспитализации")
	Тогда
		ИД_Пути = Неопределено;
		ИД_Канала = ДопСерверныеФункции.ПолучитьРеквизит(Объект.КаналГоспитализации, "УИДЕГИСЗ");
		
		Если ИД_Канала = 1 Тогда // Поликлиникой.
			ИД_Пути = 3; // Плановая госпитализация.
		ИначеЕсли ИД_Канала = 2 Тогда // Бригада скорой.
			ИД_Пути = 1;
		ИначеЕсли ИД_Канала = 4 Тогда // Самостоятельно.
			ИД_Пути = 2;
		КонецЕсли;
		
		Если ИД_Пути <> Неопределено Тогда
			Путь = ИнтеграцияЕГИСЗВызовСервера.ЭлементКлассификатораПоУИДЕГИСЗ(ИД_Пути, ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ПутиПоступленияПациентаНаГоспитализацию"));
			Если ЗначениеЗаполнено(Путь) Тогда
				Объект.ПутьПоступления = Путь;
				ПутьПоступленияПриИзменении(Элементы.ПутьПоступления);
			КонецЕсли;
		КонецЕсли;				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьПоступленияПриИзменении(Элемент)
	
	Элементы.ВидСтационараНаправления.Видимость = Объект.ПутьПоступления <> Неопределено И ДопСерверныеФункции.ПолучитьРеквизит(Объект.ПутьПоступления, "УИДЕГИСЗ") = 4;
	Объект.ВидСтационараНаправления = ?(Элементы.ВидСтационараНаправления.Видимость, Объект.ВидСтационараНаправления, Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура НадписьБроньНажатие(Элемент)
	
	Если ДанныеБрони <> Неопределено Тогда
		Койка = ДанныеБрони.Койка;
		Палата = ДанныеБрони.Палата;
		Объект.Подразделение = ДанныеБрони.Подразделение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьПоступлениеПациентаВПалату() 
	
	Если ЗначениеЗаполнено(Объект.ДатаВремяГоспитализации)
		И ЗначениеЗаполнено(Койка)
		И ЗначениеЗаполнено(Палата)
	Тогда
		НовыйУУ = Документы.УстановкаУсловийПребывания.СоздатьДокумент();
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Палата", Палата);
		ДанныеЗаполнения.Вставить("Полис", Полис);
		ДанныеЗаполнения.Вставить("Койка", Койка);
		ДанныеЗаполнения.Вставить("ВидОперации", Перечисления.ВидыДвиженияВСтационаре.Поступление);
		ДанныеЗаполнения.Вставить("ДокументОбращения", Объект.Ссылка);
		НовыйУУ.Заполнить(ДанныеЗаполнения);
		НовыйУУ.Дата = Объект.ДатаВремяГоспитализации;
		НовыйУУ.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	Элементы.ПоступлениеВПалату.Заголовок = ПолучитьФорматнуюСтрокуПоступленияВПалату(Объект.Ссылка);
	Элементы.ГруппаПолейПоступления.Видимость = Не ЗначениеЗаполнено(Элементы.ПоступлениеВПалату.Заголовок);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФорматнуюСтрокуПоступленияВПалату(Ссылка, УстановкаУсловий = Неопределено)
	
	МассивСтрок = Новый Массив;
	
	Если УстановкаУсловий = Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументОбращения", Ссылка);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УстановкаУсловийПребывания.Ссылка КАК Ссылка,
			|	УстановкаУсловийПребывания.ВидОперации КАК ВидОперации,
			|	УстановкаУсловийПребывания.Номер КАК Номер,
			|	УстановкаУсловийПребывания.Дата КАК Дата
			|ИЗ
			|	Документ.УстановкаУсловийПребывания КАК УстановкаУсловийПребывания
			|ГДЕ
			|	УстановкаУсловийПребывания.ДокументОбращения = &ДокументОбращения
			|	И НЕ УстановкаУсловийПребывания.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтрокаТекста = Строка(Выборка.ВидОперации) + " " + Строка(Выборка.Номер) + " от " + Строка(Выборка.Дата);
			
			Если МассивСтрок.Количество() <> 0 Тогда
				МассивСтрок.Добавить(", ");
			КонецЕсли;
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(СтрокаТекста,,,,ПолучитьНавигационнуюСсылку(Выборка.Ссылка)));
			
		КонецЦикла;
	Иначе
		СтрокаТекста = Строка(УстановкаУсловий.ВидОперации) + " " + Строка(УстановкаУсловий.Номер) + " от " + Строка(УстановкаУсловий.Дата);
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(СтрокаТекста,,,,ПолучитьНавигационнуюСсылку(УстановкаУсловий)));	
	КонецЕсли;
	
	Если МассивСтрок.Количество() <> 0 Тогда
		ФорматированнаяСтрокаРезультат = Новый ФорматированнаяСтрока(МассивСтрок);
		Возврат ФорматированнаяСтрокаРезультат; 
	Иначе
		Возврат "";	
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура НастроитьЭлементыФормыПриСоздании()
	
	НастроитьЭлементыДиагнозовПриСоздании();
	НастроитьЭлементФормыКаналГоспитализации();
	НастроитьЭлементФормыПричинаОбстоятельство(Элементы.ДиагнозПоступления, Режим530н, Объект.ДиагнозПоступления);
	
	// Установка отбора вида медкарт по типу Стационарная.
	Запрос = Новый Запрос;
	// Добавлено Макеев (
	ПрочиеНастройки = омг_МедицинскаяДеятельность.ПолучитьПрочиеНастройкиСистемы();
	ТипКарты = Перечисления.ТипыМедицинскихКарт.Стационар;
	Если ПрочиеНастройки.Свойство("ТипКартыСтационара") Тогда
		ТипКарты = ПрочиеНастройки.ТипКартыСтационара;
	КонецЕсли;
	Запрос.УстановитьПараметр("ТипКарты", ТипКарты);
	// )
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыМедицинскихКарт.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыМедицинскихКарт КАК ВидыМедицинскихКарт
	|ГДЕ
	|	ВидыМедицинскихКарт.ТипКарты = &ТипКарты";
	ПараметрыВыбораЗначения = Новый Массив;
	ПараметрыВыбораЗначения.Добавить(Новый ПараметрВыбора("Отбор.ВидКарты", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка")));
	ПараметрыВыбораЗначения.Добавить(Новый ПараметрВыбора("ТолькоАктуальныеКарты", Истина));
	ПараметрыВыбораЗначения.Добавить(Новый ПараметрВыбора("ДатаАктуальностиКарт", Объект.ДатаВремяГоспитализации));
	Элементы.МедицинскаяКарта.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЗначения);
	
	Элементы.СоздатьПриемВрача.Доступность = ДопСерверныеФункцииПовтИсп.ЕстьПравоДоступа("Добавление", "Документ.Прием");
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ПоступлениеВПалату.Заголовок = ПолучитьФорматнуюСтрокуПоступленияВПалату(Объект.Ссылка);
		Элементы.ГруппаПолейПоступления.Видимость = Не ЗначениеЗаполнено(Элементы.ПоступлениеВПалату.Заголовок);
	КонецЕсли;
	
	Элементы.НомерНаряда.Видимость = Не Режим530н;
	Элементы.ПервичныйПовторныйОтказ.Видимость = Не Режим530н;
	Элементы.СтраницыГоспитализацияОтказ.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	Если Объект.АлкогольноеОпьянение Или Объект.НаркотическоеОпьянение Тогда
		Элементы.ГруппаСостояниеОпьянения.Показать();
	КонецЕсли;
	
	Элементы.СоздатьМедкарту.Доступность = ПравоДоступа("ИнтерактивноеДобавление", Объект.МедицинскаяКарта.Метаданные());
	Элементы.ДатаГоспитализацииТекущая.Видимость = Не ЗначениеЗаполнено(Объект.ДатаВремяГоспитализации);
	Элементы.ВидСтационараНаправления.Видимость = Объект.ПутьПоступления <> Неопределено И Объект.ПутьПоступления.УИДЕГИСЗ = 4;
	
КонецПроцедуры

&НаСервере
Функция НастроитьЭлементФормыКаналГоспитализации()
	
	ПерваначальнаяСтрогаяНастройкаПоляСоставногоТипа(Объект.КаналГоспитализации,
													 Справочники.КаналыГоспитализации.ПустаяСсылка(),
													 Тип("Строка"),
													 Элементы.КаналГоспитализации);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НастроитьЭлементФормыПричинаОбстоятельство(ПолеПричина, Режим530н, ДиагнозПоступления)
	
	Если Режим530н Тогда
		ПараметрыВыбораПричины = Новый Массив;
		ПараметрыВыбораПричины.Добавить(Новый ПараметрВыбора("ОтборКодовДиагнозов", "S-Z")); // S00-Y99.
		ПолеПричина.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПричины);
		
		ПолеПричина.ВыбиратьТип = Ложь;
		
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.Диагнозы");
		ДиагнозПоступления = ОписаниеТипа.ПривестиЗначение(ДиагнозПоступления);
	Иначе
		ПолеПричина.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НастроитьЭлементыДиагнозовПриСоздании()
	
	Если ТипЗнч(Объект.ДиагнозПоступления) = Тип("СправочникСсылка.Диагнозы") Тогда
		ДиагнозПоступленияКодДиагноза = ДопСерверныеФункции.ПолучитьРеквизит(Объект.ДиагнозПоступления, "КодДиагноза");
	КонецЕсли;
	Если ТипЗнч(Объект.ДиагнозНаправления) = Тип("СправочникСсылка.Диагнозы") Тогда
		ДиагнозНаправленияКодДиагноза = ДопСерверныеФункции.ПолучитьРеквизит(Объект.ДиагнозНаправления, "КодДиагноза");
	КонецЕсли;
	
	ПерваначальнаяСтрогаяНастройкаПоляСоставногоТипа(Объект.ДиагнозПоступления,
													 Справочники.Диагнозы.ПустаяСсылка(),
													 Тип("Строка"),
													 Элементы.ДиагнозПоступления);
	
	ПерваначальнаяСтрогаяНастройкаПоляСоставногоТипа(Объект.ДиагнозНаправления,
													 Справочники.Диагнозы.ПустаяСсылка(),
													 Тип("Строка"),
													 Элементы.ДиагнозНаправления);
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьЗаголовокФактУпотребленияВеществ()
	
	ЗаголовокФактУпотребленияВеществ = "";
	Если Объект.АлкогольноеОпьянение Тогда
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ЗаголовокФактУпотребленияВеществ, "Алкогольное опьянение", ". ");
	КонецЕсли;
	Если Объект.НаркотическоеОпьянение Тогда
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ЗаголовокФактУпотребленияВеществ, "Иные психоактивные вещества.", ". ");
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПерваначальнаяСтрогаяНастройкаПоляСоставногоТипа(Реквизит, ЗначениеПоУмолчанию, УстаревшийТип, ПолеФормы)
	
	Если ТипЗнч(Реквизит) <> УстаревшийТип
		Или Не ЗначениеЗаполнено(Реквизит)
	Тогда
		ПолеФормы.ВыбиратьТип = Ложь;
		Если ТипЗнч(Реквизит) <> ТипЗнч(ЗначениеПоУмолчанию) Тогда
			Реквизит = ЗначениеПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьПараметрыВыбораДляПолиса(Клиент)
	
	НовыйМассив = Новый Массив;
    НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", Клиент);
    НовыйМассив.Добавить(НовыйПараметр);
	Возврат Новый ФиксированныйМассив(НовыйМассив);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПриемЗапись" И Параметр = ЭтаФорма Тогда
		Если Объект.ДокументОснование.Пустая() Тогда
			Объект.ДокументОснование = Источник;
			Модифицированность = Истина;
			
			Если Не ЗначениеЗаполнено(Объект.ДиагнозПоступления) Тогда
				Объект.ДиагнозПоступления = ПолучитьДиагнозПоступленияПриема(Объект.ДокументОснование);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "УстановкаУсловийПребывания"
		И ТипЗнч(Параметр) = Тип("Структура") 
		И Параметр.Обращение = Объект.Ссылка
	Тогда
		Элементы.ПоступлениеВПалату.Заголовок = ПолучитьФорматнуюСтрокуПоступленияВПалату(Объект.Ссылка, Параметр.УстановкаУсловийПребывания);
		Элементы.ГруппаПолейПоступления.Видимость = Не ЗначениеЗаполнено(Элементы.ПоступлениеВПалату.Заголовок);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьДиагнозПоступленияПриема(Прием)

	Если Прием.Диагнозы.Количество() > 0 Тогда
		
		СтрокаОсновнойДиагноз = Прием.Диагнозы.Найти(Перечисления.КлассификацииДиагнозов.ОсновноеЗаболевание, "Классификация3");
		Если СтрокаОсновнойДиагноз <> Неопределено Тогда
			Диагноз = СтрокаОсновнойДиагноз.Диагноз;
		Иначе
			Диагноз = Прием.Диагнозы[0].Диагноз;
		КонецЕсли;
	Иначе
		Диагноз = Справочники.Диагнозы.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Диагноз;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКойкиПалаты(Палата)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КойкоМеста.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КойкоМеста КАК КойкоМеста
		|ГДЕ
		|	КойкоМеста.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Палата);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
Функция РасположениеКойки(Койка)
	
	Расположение = Новый Структура("Палата, Подразделение");
	
	Расположение.Палата = Койка.Владелец;
	Расположение.Подразделение = Расположение.Палата.Подразделение;
	
	Возврат Расположение;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеБрони(ДанныеБрони, Клиент, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	БронированиеКойкоМеста.Клиент КАК Клиент,
	               |	БронированиеКойкоМеста.Палата КАК Палата,
	               |	БронированиеКойкоМеста.КойкоМесто КАК КойкоМесто
	               |ИЗ
	               |	Документ.БронированиеКойкоМеста КАК БронированиеКойкоМеста
	               |ГДЕ
	               |	НЕ БронированиеКойкоМеста.ПометкаУдаления
	               |	И БронированиеКойкоМеста.Проведен
	               |	И БронированиеКойкоМеста.Клиент = &Клиент
	               |	И НАЧАЛОПЕРИОДА(БронированиеКойкоМеста.ДатаНачала, ДЕНЬ) = &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	БронированиеКойкоМеста.ДатаНачала";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДанныеБрони = Новый Структура;
		ДанныеБрони.Вставить("Койка", Выборка.КойкоМесто);
		ДанныеБрони.Вставить("Палата", Выборка.Палата);
		ДанныеБрони.Вставить("Подразделение", Выборка.Палата.Подразделение);
	Иначе
		ДанныеБрони = Неопределено;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Функция ТекстДанныхБрони(кешДанныеБрони)

	Возврат "Бронь: " + кешДанныеБрони.Палата + "; " + кешДанныеБрони.Койка;	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНадписьБронь(Форма)
	
	Если Форма.Элементы.ГруппаПолейПоступления.Видимость Тогда
		ЗаполнитьДанныеБрони(Форма.ДанныеБрони, Форма.Объект.Клиент, Форма.Объект.ДатаВремяГоспитализации);
		Если Форма.ДанныеБрони <> Неопределено Тогда
			Форма.Элементы.НадписьБронь.Заголовок = ТекстДанныхБрони(Форма.ДанныеБрони);
		Иначе
			Форма.Элементы.НадписьБронь.Заголовок = "";	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры

#КонецОбласти
